#Даны два целых числа: A, B. Проверить истинность высказывания: «Справедливы неравенства A > 2 и B < 3
# Даны два целых числа: A, B. Проверить истинность высказывания: «Справедливы неравенства A > 2 и B < 3.
a = input('Введите число А: ')

while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print('Неправильно ввели число!')
        a = input('Введите число А: ')

b = input('Введите число В: ')

while type(b) != int:
    try:
        b = int(b)
    except ValueError:
        print('Неправильно ввели число!')
        b = input('Введите число В: ')

if a > 2 and b < 3:
    print('Неравенства справедливы')
else:
    print('Неравенства не справедливы')

