#Спектр видимого излучения представлен в таблице.
# Составить программу, определяющую название цвета в зависимости от введенной длины волны
n = input('Введите число: ')

while type(n) != int or (type(n) == int and n <= 0):
    try:
        x = int(n)
        if x > 0:
            n = x
        else:
            print('Число должно быть больше 0!')
            n = input('Введите число: ')
    except ValueError:
        print('Неправильно ввели число!')
        n = input('Введите число: ')

if n < 450:
    color = 'Фиолетовый'
elif 450 <= n < 480:
    color = 'Синий'
elif 480 <= n < 510:
    color = 'Сине-зеленый'
elif 510 <= n < 550:
    color = 'Зеленый'
elif 550 <= n < 570:
    color = 'Желто-зеленый'
elif 570 <= n < 590:
    color = 'Желтый'
elif 590 <= n < 630:
    color = 'Оранжевый'
else:
    color = 'Красный'

print(color)
