# Ввести двухзначное число. 
# Если сумма цифр числа четная, то увеличить число на 2, в противном случае уменьшить на 2.

n = input('Введите двухзначное число: ')

while type(n) != int:
    try:
        n = int(n)
    except ValueError:
        print('Неправильно ввели число!')
        n = input('Введите двухзначное число: ')

# Находим сумму цифр двузначного числа
sum_digits = (n // 10) + (n % 10)

if sum_digits % 2 == 0:
    n = int(n + 2)
elif sum_digits % 2 != 0:
    n = int(n - 2)

print(n)
